petersdw1/Battlab-One/MSP430.Firmware_Production_Rev_1.03.c.c
           case 't': //Set number of averages to 4
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_4_D0, 0x02);
           break;

           case 'u': //Set number of averages to 16
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_16_D0, 0x02);
           break;

           case 'v': //Set number of averages to 64
               I2C_Master_WriteReg(INA233_ADDR, 0xD0,INA233_64_D0, 0x02);
           break;

           case 'w': //Reboot the MSP430
               WDTCTL = 0;
           break;

           case 'p': //Send firmware version number
               while(!(IFG2 & UCA0TXIFG));
               UCA0TXBUF = (char) VERSION_MSB;  // 0xD1 INA233 Vshunt register MSB
               while(!(IFG2 & UCA0TXIFG));      // 0xD1 INA233 Vshunt register LSB
               UCA0TXBUF = (char) VERSION_LSB;
           break;

           case 'x':

               P2IE |= BIT1;       // P2.1 interrupt enabled/set trigger
               P2IES &= ~BIT1;    // P2.1 LO/HI edge triggering
           break;

           case 'y':
               P2IE &= (~BIT1);   // P2.1 interrupt disabled/stop transmitting
                TXMode=IDLE;
           break;

           case 'z':
               P2IE &= (~BIT1);   // P2.1 interrupt disabled/start transmitting
               TXMode=TRANSMIT;
           break;

            }
        }

    else if (UCB0STAT & UCNACKIFG)             // Receive I2C Data Interrupt
    {
        UCB0STAT &= ~UCNACKIFG;                     // Clear NACK Flags
    }
    if (UCB0STAT & UCSTPIFG)                        //Stop or NACK Interrupt
    {
        UCB0STAT &=
            ~(UCSTTIFG + UCSTPIFG + UCNACKIFG);     //Clear START/STOP/NACK Flags
    }
    else if (UCB0STAT & UCSTTIFG)
    {
        UCB0STAT &= ~(UCSTTIFG);                    //Clear START Flags
    }
}

// Port 2 Trigger Interrupt Service Routine
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
  int cntr;

  for (cntr=0;cntr<100;cntr++){

      if (cntr=99){

       if (TXMode == IDLE) {

           TXMode = TRANSMIT;  // Start capture mode
       }

       else {
       while(!(IFG2 & UCA0TXIFG));
       UCA0TXBUF = 0xFF;             // 0xD1 INA233 Vshunt register MSB
       while(!(IFG2 & UCA0TXIFG));   // 0xD1 INA233 Vshunt register LSB
       UCA0TXBUF = 0xFF;
       while(!(IFG2 & UCA0TXIFG));
       UCA0TXBUF = 0x00;             // 0xD1 INA233 Vshunt register MSB
       while(!(IFG2 & UCA0TXIFG));   // 0xD1 INA233 Vshunt register LSB
       UCA0TXBUF = 0x00;
       delay(10000);
       TXMode = IDLE;     // Stop capture mode
       }

      }
  }
   P2IES |=  BIT1;        // P2.1 HI/LO edge
   P2IFG &= ~BIT1;        // P2.1 IFG cleared
}
